<a href="https://colab.research.google.com/github/AnastasiaGilmitdinova/Gilmitdinova_practica3/blob/main/%D0%BF%D1%80%D0%B0%D0%BA%D1%82%D0%B8%D0%BA%D0%B0_3_%D0%93%D0%B8%D0%BB%D1%8C%D0%BC%D0%B8%D1%82%D0%B4%D0%B8%D0%BD%D0%BE%D0%B2%D0%B0.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

import packages

In [9]:
import pandas as pd
import numpy as np
from IPython.display import display

In [12]:
data = pd.read_csv("https://archive.ics.uci.edu/ml/machine-learning-databases/glass/glass.data", header= None)
data.head(3)

   0        1      2     3     4      5     6     7    8    9   10
0   1  1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.0  0.0   1
1   2  1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.0  0.0   1
2   3  1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.0  0.0   1

In [14]:
names = ["Id", "RI", "Na", "Mg", "Al", "Si", "R", "Ca", "Ba", "Fe", "Class"]
data.columns = names
data = data.drop(columns=['Id'])
data.head(3)

        RI     Na    Mg    Al     Si     R    Ca   Ba   Fe  Class
0  1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.0  0.0      1
1  1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.0  0.0      1
2  1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.0  0.0      1

In [15]:
data['Class'].replace({1:"building_float",
                       2:"boilding_non_float",
                       3:"vehicle_float",
                       4:"vehicle_non_float", 5:"containers",
                       6:"tableware",
                       7:"headlamps"}, inplace=True)
data['Class'].value_counts()

boilding_non_float    76
building_float        70
headlamps             29
vehicle_float         17
containers            13
tableware              9
Name: Class, dtype: int64

Находим случайные пропуски в данных

In [16]:
for col in data.columns:
  fr = np.random.randint(5,10)/100
  data.loc[data.sample(frac=fr).index, col] = np.nan
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 214 entries, 0 to 213
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   RI      199 non-null    float64
 1   Na      201 non-null    float64
 2   Mg      197 non-null    float64
 3   Al      201 non-null    float64
 4   Si      197 non-null    float64
 5   R       195 non-null    float64
 6   Ca      195 non-null    float64
 7   Ba      203 non-null    float64
 8   Fe      199 non-null    float64
 9   Class   201 non-null    object
dtypes: float64(9), object(1)
memory usage: 16.8+ KB

Data Vizualization

In [17]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 214 entries, 0 to 213
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   RI      199 non-null    float64
 1   Na      201 non-null    float64
 2   Mg      197 non-null    float64
 3   Al      201 non-null    float64
 4   Si      197 non-null    float64
 5   R       195 non-null    float64
 6   Ca      195 non-null    float64
 7   Ba      203 non-null    float64
 8   Fe      199 non-null    float64
 9   Class   201 non-null    object
dtypes: float64(9), object(1)
memory usage: 16.8+ KB

In [18]:
data.describe()

               RI          Na          Mg  ...          Ca          Ba          Fe
count  199.000000  201.000000  197.000000  ...  195.000000  203.000000  199.000000
mean     1.518305   13.395124    2.712030  ...    8.944615    0.181330    0.058543
std      0.003079    0.828411    1.425107  ...    1.436522    0.508532    0.097491
min      1.511150   10.730000    0.000000  ...    5.430000    0.000000    0.000000
25%      1.516460   12.880000    2.200000  ...    8.240000    0.000000    0.000000
50%      1.517640   13.290000    3.480000  ...    8.590000    0.000000    0.000000
75%      1.519100   13.830000    3.600000  ...    9.105000    0.000000    0.100000
max      1.533930   17.380000    4.490000  ...   16.190000    3.150000    0.510000

[8 rows x 9 columns]

In [20]:
data["Class"].describe()

count                    201
unique                     6
top       boilding_non_float
freq                      72
Name: Class, dtype: object

In [25]:
display(data["Class"]. describe())
display(data["Class"].value_counts())

count                    201
unique                     6
top       boilding_non_float
freq                      72
Name: Class, dtype: object

boilding_non_float    72
building_float        66
headlamps             28
vehicle_float         16
containers            10
tableware              9
Name: Class, dtype: int64